Examinator/src/Enums/СтатусыПрохожденияОбъектовСУО/СтатусыПрохожденияОбъектовСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПрохожденияОбъектовСУО</name>
  <enumValues>
    <name>Зачислен</name>
  </enumValues>
  <enumValues>
    <name>Проходит</name>
  </enumValues>
  <enumValues>
    <name>Завершил</name>
  </enumValues>
  <enumValues>
    <name>НеЗавершил</name>
  </enumValues>
  <enumValues>
    <name>НеДопущен</name>
  </enumValues>
  <enumValues>
    <name>Автомат</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыПубликацийЭлектронныхРесурсовСУЗ/ТипыПубликацийЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПубликацийЭлектронныхРесурсовСУЗ</name>
  <enumValues>
    <name>WS</name>
  </enumValues>
  <enumValues>
    <name>HTML</name>
  </enumValues>
  <enumValues>
    <name>SCORM_1_3</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Documents/ПопыткаВыполненияЗаданияСУО/ПопыткаВыполненияЗаданияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПопыткаВыполненияЗаданияСУО</name>
  <registerRecords>InformationRegister.БиблиотекаПользователейСУО</registerRecords>
  <registerRecords>InformationRegister.ПопыткиПрохожденияЗаданийСУО</registerRecords>
  <attributes>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Вариант</name>
    <type>
      <types>CatalogRef.ВариантыЗаданийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПопыткаЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращеноНаДоработку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВозвратаНаДоработку</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиНаПроверку</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВозвратаНаДоработку</name>
    <type>
      <types>CatalogRef.ПричиныВозвратаЗаданияНаДоработкуСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверившийПреподаватель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяющийПреподаватель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктивностиПроверки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроходнойБалл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗатраченоВремениВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДоступаКЗаданию</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДоступаКЗаданию</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьВремяДоступаКЗаданию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

Examinator/src/Documents/ПрохождениеОбученияСУО/ПрохождениеОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрохождениеОбученияСУО</name>
  <registerRecords>InformationRegister.РасписаниеОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.ФайлыНаПроверкуПреподавателюСУО</registerRecords>
  <registerRecords>InformationRegister.УчастникиОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.ОценкиКачестваОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.БиблиотекаПользователейСУО</registerRecords>
  <registerRecords>InformationRegister.ПрохожденияОбученияСУО</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеПрохождение</name>
    <type>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущиеБаллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <comment>Только для электронного обучения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <comment>Только для электронного обучения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращеноНаДоработку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоВремениВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоВремениСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаКачестваОбучения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКачестваОбучения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОцениванияКачестваОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставленаОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/CommonModules/ЭлектронныеРесурсыПереопределяемый/Module.bsl
// Позволяет переопределить настройки тестирования
//
// Параметры:
//   * НастройкиТестированияXDTO - ФабрикаXDTO - http://v8.1c.ru/kms/1/Collection
//   * КонтекстВыполнения        - Структура - Список свойств структуры см. процедуру
//                                 ЗаполнитьКонтекстВыполненияОбъекта модуля ОбъектыСУЗ
//
Процедура ПриЗаполненииНастроекТестирования(НастройкиТестированияXDTO, КонтекстВыполнения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	// Если тест проходится в рамках прохождения мероприятия, а пользователь
	// Мероприятия не совпадает с текущим, то тест будет в режиме ТолькоПросмотр.
	// А так же если мероприятие завершено или не завершено.	
	
	Если КонтекстВыполнения.Свойство("ПрохождениеОбучения")
		И ЗначениеЗаполнено(КонтекстВыполнения.ПрохождениеОбучения)
		И (КонтекстВыполнения.ПрохождениеОбучения.Пользователь <> ОбъектыСУЗ.ТекущийПользователь(КонтекстВыполнения)
		ИЛИ КонтекстВыполнения.ПрохождениеОбучения.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил
		ИЛИ КонтекстВыполнения.ПрохождениеОбучения.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Автомат
		ИЛИ  КонтекстВыполнения.ПрохождениеОбучения.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.НеЗавершил) Тогда
			
			НастройкиТестированияXDTO.ТолькоПросмотр = Истина; 
	
	КонецЕсли;
	
	//----------------------------------//
	
	НастройкиТестированияXDTO.ЕстьПравоДобавитьПопытку = (Пользователи.ЭтоПолноправныйПользователь(,,Ложь) ИЛИ РольДоступна(Метаданные.Роли.ЭлектронныеРесурсыАдминистрированиеСУО)); //--# КОНСТРУКТОР КУРСОВ ЗАМЕНИТЬ РОЛЬ 
	
КонецПроцедуры

Процедура ПриПросмотреЭлектронногоРесурса(ЭлектронныйРесурс, ПрохождениеОбучения, Задание) Экспорт
	
	
КонецПроцедуры

Процедура ПослеПрохожденияТестирования(НомерДокументаТестирования, ПрохождениеОбучения, Задание) Экспорт
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	Если ЗначениеЗаполнено(ПрохождениеОбучения) Тогда
			
		Если ЗначениеЗаполнено(Задание) Тогда
			ОбучениеСУО.ПриПрохожденииЗадания(ПрохождениеОбучения, Задание);
		Иначе
			ОбучениеСУО.ПриПрохожденииМероприятия(ПрохождениеОбучения);
		КонецЕсли;
		
	КонецЕсли;	
	
	//----------------------------------//
	
КонецПроцедуры

Процедура ПриЗакрытииЭлектронногоРесурса(ЭлектронныйРесурс, ПрохождениеОбучения, Задание) Экспорт	
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	Если ЗначениеЗаполнено(ПрохождениеОбучения) Тогда
		
		Если ЗначениеЗаполнено(Задание) Тогда
			ОбучениеСУО.ПриПрохожденииЗадания(ПрохождениеОбучения, Задание);
		Иначе
			ОбучениеСУО.ПриПрохожденииМероприятия(ПрохождениеОбучения);
		КонецЕсли;
		
	КонецЕсли;
	
	//----------------------------------//
	
КонецПроцедуры

Процедура ПередДобавлениемПопыткиТестирования(Пользователь, ЭлектронныйРесурс, Тест, ПрохождениеОбучения, Задание) Экспорт
	
	Пользователь = ?(ЗначениеЗаполнено(ПрохождениеОбучения), ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПрохождениеОбучения, "Пользователь"), Пользователь);
	
КонецПроцедуры

Процедура ПослеДобавленияПопыткиТестирования(Пользователь, ЭлектронныйРесурс, Тест, ПрохождениеОбучения, Задание) Экспорт
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//

	Если ЗначениеЗаполнено(ПрохождениеОбучения) Тогда		
		ОбучениеСУО.ПриПрохожденииМероприятия(ПрохождениеОбучения, Перечисления.СтатусыПрохожденияОбъектовСУО.Проходит,,,Истина);
	КонецЕсли;	
	
	//----------------------------------//
	
КонецПроцедуры

Процедура ПослеСохраненияДанныхПрохожденияПубликации(ЭлектронныйРесурс, ПрохождениеОбучения, Задание, Пользователь, Синхронно = Ложь) Экспорт	
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	Если ЗначениеЗаполнено(ПрохождениеОбучения) Тогда
		
		ВремяОжидания = ?(Синхронно, 15, 6);
		
		Отбор = Новый Структура;
		Отбор.Вставить("ИмяМетода", "ОбучениеСУО.ПриПрохожденииЭлектронногоРесурса");
		Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
		Отбор.Вставить("Ключ", Строка(Пользователь.УникальныйИдентификатор()));
		ФоновыеЗаданияОбновления = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
		
		Если ФоновыеЗаданияОбновления.Количество() > 0 Тогда
			
			Попытка
				ФоновыеЗадания.ОжидатьЗавершения(ФоновыеЗаданияОбновления, ВремяОжидания);
			Исключение
				
				ЗаписьЖурналаРегистрации(
					НСТр("ru = 'Веб-кабинет.Обновление данных'"),
					УровеньЖурналаРегистрации.Предупреждение,
					,
					ПрохождениеОбучения,
					НСТр("ru = 'Фоновое обновление данных при изучении электронного курса выполняется слишком долго. Время ожидания:'") + Строка(ВремяОжидания) + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					
				Если НЕ Синхронно Тогда		
					Возврат; // Не дождались
				КонецЕсли;
				
			КонецПопытки;				
			
		КонецЕсли;
		
		Если Синхронно Тогда
			
			Попытка
				ОбучениеСУО.ПриПрохожденииЭлектронногоРесурса(ПрохождениеОбучения, Задание);
			Исключение
				
				ЗаписьЖурналаРегистрации(
					НСТр("ru = 'Веб-кабинет.Обновление данных'"),
					УровеньЖурналаРегистрации.Ошибка,
					,
					ПрохождениеОбучения,
					НСТр("ru = 'Синхронная операция обновления данных обучения завершилась с ошибкой'")  + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					
				Синхронно = Ложь;
				
			КонецПопытки;			
			
		КонецЕсли;
		
		Если НЕ Синхронно Тогда
			
			МассивПараметровФЗ = Новый Массив;
			МассивПараметровФЗ.Добавить(ПрохождениеОбучения);
			МассивПараметровФЗ.Добавить(Задание);
			
			Попытка
				ФоновыеЗадания.Выполнить("ОбучениеСУО.ПриПрохожденииЭлектронногоРесурса", МассивПараметровФЗ, Строка(Пользователь.УникальныйИдентификатор()));
			Исключение
				
				ЗаписьЖурналаРегистрации(
				НСТр("ru = 'Веб-кабинет.Обновление данных'"),
				УровеньЖурналаРегистрации.Ошибка,
				,
				ПрохождениеОбучения,
				НСТр("ru = 'Запуск фонового задания при изучении электронного курса не удался.'")  + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				Возврат;
				
			КонецПопытки;				
			
		КонецЕсли;
		
		
	КонецЕсли;		
	
	//----------------------------------//
	
КонецПроцедуры

Процедура ПриОпределенииПраваПросмотраПрохожденийДругихПользователей(ЕстьПраво) Экспорт
	
	ЕстьПраво = ОбучениеСУОПовтИсп.ЕстьПравоПросматриватьВыполненныеЗадания(); //--# ЗАМЕНИТЬ НА: КонструкторКурсов.ЕстьПравоПросмотраСессий()
	
КонецПроцедуры

Процедура ПриОпределенииТипПубликацииПоУмолчанию(ТипПубликации) Экспорт	
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	Если ВебКабинетСУ.Используется() Тогда
		
		ТипПубликации = Перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.WS;
		
	Иначе
		
	//----------------------------------//
		
		ТипПубликации = Перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.HTML;
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриОпределенииДоступныхТиповПубликации(ТипыПубликацииДляИсключения) Экспорт
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	Если ВебКабинетСУ.Используется() Тогда
		
		ИндексТипа = ТипыПубликацииДляИсключения.Найти(Перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.WS);
		
		Если ИндексТипа <> Неопределено Тогда
			ТипыПубликацииДляИсключения.Удалить(ИндексТипа); // Убираем публикацю для ВК из исключенных
		КонецЕсли;		

	КонецЕсли;	
	
	//----------------------------------//
	
КонецПроцедуры

Процедура ПослеЗагрузкиЭлектронногоРесурса() Экспорт
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	Справочники.СводыЗнанийСУЗ.ОбновитьДанныеВебКабинетаДляВсехПользователей();
	
	//----------------------------------//

	
КонецПроцедуры

Функция ИмяПодсистемы() Экспорт
	
	Возврат Метаданные.Имя;
	
КонецФункции

Процедура ПроведениеОбучения(ПроведениеОбучения, ПрохождениеОбучения) Экспорт
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	Если ЗначениеЗаполнено(ПрохождениеОбучения) Тогда
		ПроведениеОбучения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПрохождениеОбучения, "ПроведениеОбучения");
	КонецЕсли;
	
	//----------------------------------//
	
КонецПроцедуры

Процедура ПользовательОбучения(Пользователь, ПрохождениеОбучения) Экспорт
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//

	Если ЗначениеЗаполнено(ПрохождениеОбучения) Тогда
		Пользователь = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПрохождениеОбучения, "Пользователь");
	КонецЕсли;
	
	//----------------------------------//
	
КонецПроцедуры

Функция ОбучениеОтменено(Знач ИзучениеОтменено, Знач ПрохождениеОбучения, Знач Задание) Экспорт
	
	Отменено = ИзучениеОтменено;
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	Если НЕ Отменено Тогда
	
		ПопыткаВыполненияЗадания = ОбучениеСУО.ПоследнееПрохождениеЗадания(ПрохождениеОбучения, Задание);
		Если ЗначениеЗаполнено(ПопыткаВыполненияЗадания) Тогда
			Отменено = Документы.ПопыткаВыполненияЗаданияСУО.Отменено(ПопыткаВыполненияЗадания);
		ИначеЕсли ЗначениеЗаполнено(ПрохождениеОбучения) Тогда
			Отменено = Документы.ПрохождениеОбученияСУО.Отменено(ПрохождениеОбучения);
		КонецЕсли;
		
	КонецЕсли;
		
	//----------------------------------//
	
	Возврат Отменено;
	
КонецФункции
